of+1806/tutorials/cavity_heatedWalls/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   
    movingLid
    {
       type            zeroGradient;
    }
    
    bottomWall
    {
       type            zeroGradient;
    }
    
    westWall
    {
       type            zeroGradient;
    }
    
    eastWall
    {
       type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
